"use strict";

/*
Необходимо попросить пользователя ввести три числа.
Необходимо создать функцию, в которую мы должны передать эти три числа.
Функция должна определить максимальное, среди переданных ей значение и 
вывести сообщение: "Максимальное значение среди чисел N1, N2, N3 равно N."

Примечание: Условимся, что пользователь всегда вводит корректные значения, 
три числа. Проверять их не нужно.
*/

// function maxi(a, b, c) {
//   const result = Math.max(a, b, c);
//   return result;
// }
// const userNumber1 = Number(prompt("Введите первое число"));
// const userNumber2 = Number(prompt("Введите второе число"));
// const userNumber3 = Number(prompt("Введите третье число"));

// console.log(
//   `Максимальное значение среди чисел ${userNumber1}, ${userNumber2}, ${userNumber3} равно`,
//   maxi(userNumber1, userNumber2, userNumber3)
// );
